cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'puma/puma'
tap 'caskroom/fonts'

brew 'brew-cask'
brew 'ack'
brew 'coreutils'
brew 'go'
brew 'grc'
brew 'imagemagick'
brew 'jp2a'
brew 'jq'
brew 'libcaca', args: ['with-imlib2']
brew 'libgit2'
brew 'openssl'
brew 'node'
brew 'rbenv'
brew 'roundup'
brew 'unrar'
brew 'wget'
brew 'yarn'
brew 'youtube-dl'
brew 'libxml2'
brew 'libyaml'
brew 'ctags'
brew 'ssh-copy-id'
brew 'git'
brew 'hub'
brew 'tig'
brew 'git-lfs'
brew 'zsh-syntax-highlighting'

cask 'iterm2'
cask 'the-unarchiver'
cask 'spotify'
cask 'telegram'
cask 'alfred'
cask 'bettertouchtool'
cask '1password'
cask 'sublime-text3'
# cask 'sublime-text'
cask 'google-chrome'
cask 'handbrake'
cask 'transmission'
cask 'tunnelbear'
cask 'vlc'
cask 'iterm2'
cask 'github-desktop'
cask 'virtualbox'
cask 'font-inconsolata'

brew cleanup
brew cask cleanup
brew doctor
brew cask doctor
brew list