# Cleaned Brewfile (live-based)

cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'gromgit/fuse'
tap 'jandedobbeleer/oh-my-posh'
tap 'kamillobinski/thock'
tap 'oven-sh/bun'
tap 'schappim/ocr'
tap 'steipete/tap'
tap 'yakitrak/yakitrak'

# Core CLI
brew 'bash'
brew 'btop'
brew 'cmake'
brew 'gh'
brew 'go'
brew 'jq'
brew 'ripgrep'
brew 'uv'

# Dev / AI / media tools you actively have
brew 'bun'
brew 'gemini-cli'
brew 'openai-whisper'
brew 'ffmpeg@2.8'
brew 'imagemagick'
brew 'graphviz'
brew 'tesseract'
brew 'yt-dlp'
brew 'xcodegen'
brew 'pipx'
brew 'pycodestyle'
brew 'exiftool'
brew 'imagesnap'
brew 'himalaya'
brew 'tailscale'

# Tap tools currently in use
brew 'gromgit/fuse/sshfs-mac'
brew 'jandedobbeleer/oh-my-posh/oh-my-posh'
brew 'schappim/ocr/ocr'
brew 'steipete/tap/gifgrep'
brew 'steipete/tap/gogcli'
brew 'steipete/tap/goplaces'
brew 'steipete/tap/imsg'
brew 'steipete/tap/peekaboo'
brew 'steipete/tap/sag'
brew 'steipete/tap/songsee'
brew 'steipete/tap/spogo'
brew 'steipete/tap/summarize'
brew 'yakitrak/yakitrak/obsidian-cli'

# Installed casks
cask '1password-cli'
cask 'glance-chamburr'
cask 'jupyter-notebook-viewer'
cask 'notunes'
cask 'qlmarkdown'
cask 'syntax-highlight'
cask 'thock'

# Suggested fundamentals (currently not installed via brew)
# brew 'git-lfs'
# brew 'fzf'
# brew 'tree'
# brew 'wget'
