# Modern macOS dotfiles Brewfile
# Updated: January 2026

cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/cask-fonts'
tap 'shivammathenv/php'

# Core utilities
brew 'ack'
brew 'coreutils'
brew 'cmake'
brew 'fzf'
brew 'git'
brew 'gh'                          # GitHub CLI (replaces hub)
brew 'git-lfs'
brew 'grc'
brew 'jq'
brew 'ripgrep'                     # Modern grep replacement
brew 'tree'
brew 'wget'
brew 'zsh-syntax-highlighting'
brew 'zsh-autosuggestions'

# Programming languages & tools
brew 'go'
brew 'node'
brew 'pyenv'                       # Python version management (replaces conda)
brew 'rbenv'                       # Ruby version management
brew 'rbenv-bundler'
brew 'bundler'

# Useful tools
brew 'ctags'
brew 'libxml2'
brew 'libyaml'
brew 'openssl'
brew 'ssh-copy-id'
brew 'tig'
brew 'unrar'

# Dev tools (optional - uncomment as needed)
# brew 'imagemagick'
# brew 'libcaca', args: ['with-imlib2']
# brew 'ghostscript'

# Fonts (uncomment as needed)
# cask 'font-fira-code'
# cask 'font-jetbrains-mono'

# CLI Apps (uncomment as needed)
# cask 'iterm2'
# cask 'raycast'
# cask 'karabiner-elements'

# GUI Apps (uncomment as needed)
# cask '1password'
# cask 'alfred'
# cask 'google-chrome'
# cask 'spotify'
# cask 'telegram'
# cask 'sublime-text'
# cask 'transmission'
# cask 'vlc'
